# Yosys synthesis script for router_tb
# Read verilog files
read_verilog  ./benchmark/router_tb.v

read_verilog /home/rsunketa/OpenFPGA/test_runs/router-rtl-files/clib/*v
read_verilog /home/rsunketa/OpenFPGA/test_runs/router-rtl-files/*v

# Technology mapping
hierarchy -top router_tb
proc

techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
flatten -wb
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt -nodffe -nosdff
wreduce
peepopt
opt_clean
opt -nodffe -nosdff
memory -nomap
opt_clean
opt -fast -full -nodffe -nosdff
memory_map
opt -full -nodffe -nosdff
techmap
opt -fast -nodffe -nosdff
clean

clean

# LUT mapping
abc -lut 4

# Check
synth -run check

# Clean and output blif
opt_clean -purge

write_verilog router_tb_output_verilog.v
write_blif rewritten_router_tb_yosys_out.blif
